# -*- coding: utf-8 -*-
##############################################################################
# Author：QQ173782910
##############################################################################
import redis
# 注意：
#    持仓方向为单向,不会设置杠杆
#    下边的dingding_token,wx_openid为空的话是不会发送钉钉消息和公众号消息

version_flag = '20211024'

key = ""  # 币安API的key
secret = ""  # 币安API的secret

dingding_token = ""  # 钉钉webhook的access_token
wx_openid = ""  # 关注简道斋后发送openid得到的那一串字符就是这个

tactics_flag = 0  # 此为机器人执行策略计算无信号是否发送钉钉消息，约5分钟发送一次，1为发送，不发送请留空或其他值
add_pos_flag = 0  # 加仓标识，为1开启，0关闭,加仓是当币在扛单中，再次遇到开仓信号就又开一次仓，这样会降低持仓均价，但爆仓风险更大
add_pos_amount = 0  # 加仓次数，0不限次数，其他的整数值为最大加仓次数，每个币的次数一样，不单独设置

# [币对,下单量,止盈参数,补仓参数]  补仓:是币已经止盈，当前无持仓，当币价回调到一定价格就再次开仓
symbols_conf = [["AAVEUSDT", 0.2, 1.007, 0.972],  # ok
                ["KSMUSDT", 0.3, 1.007, 0.972],  # ok  N
                ["UNIUSDT", 1.0, 1.007, 0.972],  # ok
                ["EGLDUSDT", 0.6, 1.01, 0.972],  # ok  N
                ["BNBUSDT", 0.03, 1.007, 0.972],  # ok
                ["SOLUSDT", 1, 1.01, 0.972],  # ok
                ["DOTUSDT", 0.6, 1.007, 0.972],  # ok
                ["BTCUSDT", 0.001, 1.01, 0.972],  # ok
                ["YFIUSDT", 0.002, 1.007, 0.972],  # ok
                ["ETHUSDT", 0.002, 1.007, 0.972],  # ok
                ["LTCUSDT", 0.03, 1.007, 0.972],  # ok
                ["BCHUSDT", 0.08, 1.007, 0.972],  # ok
                ["MKRUSDT", 0.005, 1.007, 0.972],  # ok
                ["DASHUSDT", 0.09, 1.007, 0.972],  # ok
                ["ZECUSDT", 0.5, 1.007, 0.972],  # ok
                ["ZENUSDT", 0.3, 1.007, 0.972],  # ok
                ["FILUSDT", 0.4, 1.007, 0.972],  # ok
                ["AVAXUSDT", 1, 1.007, 0.972],  # ok
                ["LUNAUSDT", 2, 1.007, 0.972],  # ok  # N
                ["YFIIUSDT", 0.003, 1.006, 0.972],  # ok
                ["COMPUSDT", 0.03, 1.007, 0.972],  # ok
                ["XMRUSDT", 0.05, 1.007, 0.972],  # ok
                ["TRBUSDT", 0.5, 1.007, 0.972],  # ok
                ["NEOUSDT", 0.5, 1.007, 0.972],  # ok
                ["NEARUSDT", 4.0, 1.007, 0.972],  # ok
                ["ATOMUSDT", 0.5, 1.007, 0.972],  # ok
                ["AXSUSDT", 2, 1.007, 0.972],
                ["ICPUSDT", 0.6, 1.007, 0.972],  # N
                ["WAVESUSDT", 0.6, 1.007, 0.972],  # N
                ["LINKUSDT", 0.6, 1.007, 0.972],
                ["BALUSDT", 0.6, 1.007, 0.972],
                ["HNTUSDT", 2, 1.007, 0.972],
                ["DYDXUSDT", 1.1, 1.007, 0.972],
                ["ALICEUSDT", 1.2, 1.007, 0.972],
                ["SNXUSDT", 1.1, 1.007, 0.972],
                ["QTUMUSDT", 1.2, 1.007, 0.972],
                ["RAYUSDT", 0.9, 1.007, 0.972],  # N
                ["SUSHIUSDT", 3, 1.007, 0.972],
                ["OMGUSDT", 1.2, 1.007, 0.972],
                ["MASKUSDT", 2, 1.007, 0.972],
                ["UNFIUSDT", 1.2, 1.007, 0.972],
                ["SRMUSDT", 3, 1.007, 0.972],
                ["GTCUSDT", 1.5, 1.007, 0.97],
                ["RUNEUSDT", 3, 1.007, 0.972],
                ["BANDUSDT", 2, 1.007, 0.972],
                ["XTZUSDT", 3, 1.007, 0.972],  # N
                ["THETAUSDT", 3, 1.007, 0.972],  # N
                ["KAVAUSDT", 3, 1.007, 0.972],
                ]  # 48

symbols_conf2 = [["ARUSDT", 0.4, 1.007, 0.972],  # ok
                 ["CELOUSDT", 2, 1.007, 0.972],  # ok  N
                 ["RLCUSDT", 2.5, 1.007, 0.972],  # ok  N
                 ["LITUSDT", 2.5, 1.007, 0.972],  # ok
                 ["C98USDT", 3, 1.007, 0.972],  # ok
                 ["MTLUSDT", 3, 1.007, 0.972],
                 ["1INCHUSDT", 3, 1.007, 0.972],
                 ["CRVUSDT", 7.1, 1.007, 0.972],
                 ["SXPUSDT", 3.6, 1.007, 0.972],
                 ["AUDIOUSDT", 4, 1.007, 0.972],  # ok

                 ["TOMOUSDT", 4, 1.007, 0.972],  # ok
                 ["ADAUSDT", 4, 1.007, 0.972],
                 ["ICXUSDT", 4, 1.007, 0.972],
                 ["BAKEUSDT", 4, 1.007, 0.972],
                 ["BELUSDT", 4, 1.007, 0.972],
                 ["ALGOUSDT", 5, 1.007, 0.972],
                 ["CTKUSDT", 8, 1.007, 0.972],  # ok
                 ["KNCUSDT", 4, 1.007, 0.972],
                 ["ENJUSDT", 9, 1.007, 0.972],
                 ["FTMUSDT", 9, 1.007, 0.972],

                 ["DODOUSDT", 9.6, 1.007, 0.972],  # ok
                 ["MATICUSDT", 7, 1.007, 0.972],
                 ["IOTAUSDT", 6.7, 1.007, 0.972],  # N
                 ["STORJUSDT", 8, 1.007, 0.972],
                 ["XRPUSDT", 9, 1.007, 0.972],  # ok
                 ["RENUSDT", 9, 1.007, 0.972],  # ok  N
                 ["SFPUSDT", 9, 1.007, 0.972],
                 ["ZRXUSDT", 10.3, 1.007, 0.972],
                 ["ALPHAUSDT", 10, 1.007, 0.972],
                 ["ATAUSDT", 10, 1.007, 0.972],  # ok

                 ["ONTUSDT", 9.5, 1.007, 0.972],
                 ["OGNUSDT", 10, 1.007, 0.972],
                 ["SANDUSDT", 10, 1.007, 0.972],
                 ["MANAUSDT", 12, 1.007, 0.972],  # N
                 ["GRTUSDT", 18, 1.007, 0.972],
                 ["OCEANUSDT", 11, 1.007, 0.972],  # N
                 ["BATUSDT", 12.4, 1.007, 0.972],
                 ["CVCUSDT", 16, 1.007, 0.972],
                 ["FLMUSDT", 16, 1.007, 0.972],
                 ["KEEPUSDT", 20, 1.007, 0.972],

                 ]

symbols_conf3 = [
                 ["LRCUSDT", 26, 1.007, 0.972],
                 ["HBARUSDT", 26, 1.007, 0.972],
                 ["CHRUSDT", 28, 1.007, 0.972],
                 ["SKLUSDT", 29, 1.007, 0.972],
                 ["NKNUSDT", 26, 1.007, 0.972],
                 ["XLMUSDT", 27, 1.007, 0.972],
                 ["BZRXUSDT", 30, 1.007, 0.972],
                 ["CHZUSDT", 45, 1.007, 0.972],
                 ["1000XECUSDT", 37, 1.007, 0.972],
                 ["BLZUSDT", 68, 1.007, 0.972],

                 ["DOGEUSDT", 34, 1.007, 0.972],
                 ["TLMUSDT", 40, 1.007, 0.972],
                 ["ONEUSDT", 85, 1.007, 0.972],
                 ["XEMUSDT", 56, 1.007, 0.972],
                 ["CELRUSDT", 64, 1.007, 0.972],
                 ["VETUSDT", 147, 1.007, 0.972],
                 ["RVNUSDT", 74, 1.007, 0.972],
                 ["GALAUSDT", 151, 1.007, 0.972],
                 ["ZILUSDT", 92, 1.007, 0.972],
                 ["TRXUSDT", 93, 1.007, 0.972],

                 ["ANKRUSDT", 99, 1.007, 0.972],
                 ["IOSTUSDT", 161, 1.007, 0.972],  # N
                 ["DGBUSDT", 336, 1.007, 0.972],
                 ["RSRUSDT", 258, 1.007, 0.972],  # N
                 ["LINAUSDT", 187, 1.007, 0.972],  # N
                 ["BTSUSDT", 388, 1.007, 0.972],
                 ["STMXUSDT", 283, 1.007, 0.972],  # N
                 ["AKROUSDT", 459, 1.007, 0.972],
                 ["SCUSDT", 925, 1.007, 0.972],
                 ["1000SHIBUSDT", 305, 1.0075, 0.972],
                 ["DENTUSDT", 1500, 1.007, 0.972],
                 ]

redis_pool = redis.ConnectionPool(host='127.0.0.1', port='6379', db='0', password='')
redisc = redis.StrictRedis(connection_pool=redis_pool)
